The spacing between the bars, according to the LayoutRule.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public double Spacing { get; }
  Visual Basic
Public ReadOnly Property Spacing As Double
	Get
  Visual C++
public:
property double Spacing {
	double get ();
}
 See Also
  RebarUpdateCurvesData Class
  Autodesk.Revit.DB.Structure Namespace